ednieuw/Arduino-ESP32-Nano-Wordclock/ESP32_WordClockV195/ESP32_WordClockV195.ino
 const char *menusmall[] = {
 "F Own colour (Hex FWWRRGGBB)",
 "I Menu, II long menu",
 "N Display off between Nhhhh (N2208)",
 "O Display On/Off",
 "Q Display colour choice (Q0)",
 "R Reset settings, @ Restart" };
//  -------------------------------------   End Definitions  ---------------------------------------

//--------------------------------------------                                                //
// ARDUINO Setup
//--------------------------------------------
void setup() 
{
 Serial.begin(115200);                                                                        // Setup the serial port to 115200 baud
 Wire.begin();                                                                                // Maybe not necessary
 int32_t Tick = millis(); 
 InitStorage();                                                                               // Load settings from storage and check validity   
 StartLeds();                                                                                 // Select the SK6812 or WS2812 LED strip and initialysed
 SetStatusLED(10,0,0);                                                                        // Set the status LED to red
 while (!Serial && ( (millis()-Tick) < 3002)) { LEDstartup(green);delay(500); }              // Wait max 1.5 sec to establish serial connection
 SetStatusLED(10,0,10);                                                                       // Set the status LED to red
 while (!Serial && ( (millis()-Tick) < 3000)) { LEDstartup(purple); delay(250); }              // Wait max 3 sec to establish serial connection
 PrintHeaps();                                                                                // Print memory usage  
 LEDstartup(capri); Tekstprintln("Serial started\nStored settings loaded\nLED strip started");// InitStorage and StartLEDs must be called first
 Mem.MCUrestarted++;                                                                          // MCU Restart counter     
 if(Mem.MCUrestarted>5) { Reset(); }                                                          // If the MCU restarts during Setup() so often -> Reset() but no ResetCredentials(); 
 StoreStructInFlashMemory();                                                                  // Store the Mem.MCUrestarted
 Tekstprintlnf("Using %s LED library", UsedEDSOFTLED?"EDSOFTLED":"NEOPIXEL");                 // 
 Tekstprintlnf("LED strip is %s", Mem.LEDstrip?"WS2812":"SK6812" );
 if(Mem.UseRotary==1) {LEDstartup(pink);  InitRotaryMod(); Tekstprintln("Rotary available"); }        // Start the Rotary encoder
 if(Mem.UseRotary==2) {LEDstartup(grass); InitKeypad3x1(); Tekstprintln("Keypad available"); }        // Start the Keypad 3x1 
 if(Mem.UseRotary >2) {LEDstartup(white); Start_IRreceiver();Tekstprintln("IRremote available");}     // Start IR remote Mem.UseRotary = 3 or 4                                                                                     
 if(Mem.BLEOn)        {LEDstartup(blue);  StartBLEService(); Tekstprintln("BLE started"); }           // Start BLE service 
 if(Mem.WIFIOn)       {LEDstartup(purple); ConnectWIFI();  Tekstprintln("WIFI started"); }            // Start WIFI and optional NTP if Mem.WIFIOn = 1 
 InitTimeSystem();     LEDstartup(yellow); Tekstprintln("Time system started");                       // Initialize RTC + DS3231 sync
 if(Mem.TimeReceiver) {LEDstartup(blue); StartTimeReceiverScan();Tekstprintln("Time Receiver started"); } // Time Receiver app on iPhone can be used
 Previous_LDR_read = ReadLDR();                                                                       // Set the initial LDR reading 
 GetTijd(true);                                                                               // Get the time and do not print it
 LEDstartup(green);                                                                           // Set the status LED to green
 SWversion();                                                                                 // Print the menu + version 
 StoreStructInFlashMemory();                                                                  // 
 delay(250);
 LEDstartup(CLEARLEDSTARTUP);                                                                 // Erase the startup LEDs from the clock display
 Tekstprintln("Setup finished");
    #ifdef ARDUINO_BOARD
 Tekstprint("Compiled on: "); Tekstprintln(ARDUINO_BOARD);
    #endif 
 Tekstprintlnf("Software version: %s", SoftwareName());
 msTick = millis();                                                                           // Start the seconds loop counter
}

//--------------------------------------------                                                //
// ARDUINO Loop
//--------------------------------------------
void loop() 
{
 Loopcounter++;
 if (Demo)            Demomode();                                                             // 
 else if(FireDisplay) FireMode();                                                             //
 else                 EverySecondCheck();                                                     // Let the second led tick and run the clock program
 CheckDevices();
}

//--------------------------------------------                                                //
// COMMON Check connected input devices
//--------------------------------------------
void CheckDevices(void)
{
 CheckBLE();                                                                                  // Something with BLE to do?
 SerialCheck();                                                                               // Check serial port every second
 CheckWIFIcommand();                                                                          // Check if there is a command given from the web page
 if (Mem.TimeReceiver) CheckTimeReceiverClient();                                             // Check if Timesender app is in the air
 if (OptionYRainbow ) { ReworkInputString("Y"); OptionYRainbow=false;}                        // The LED library’s timing can get interrupted by background WiFi interrupts, causing flicker in the strip.
 if (Mem.UseRotary==1) RotaryEncoderCheck();
 if (Mem.UseRotary==2) Keypad3x1Check();                                                      // 
                                  #ifdef ONEWIREKEYPAD3x4   
 OnewireKeypad3x4Check(); 
                                  #endif  //ONEWIREKEYPAD3x4
                                  #ifdef ONEWIREKEYPAD3x1   
 OnewireKeypad3x1Check(); 
                                  #endif  //ONEWIREKEYPAD3x1
}
//--------------------------------------------                                                //
// COMMON Update routine 
// Performs tasks every second
//--------------------------------------------
void EverySecondCheck(void)
{
 static bool Toggle = 0;
 uint32_t msLeap = millis() - msTick;                                                         // 
 if (msLeap % 100) Every100mSecCheck();
 if (msLeap > 999)                                                                            // Every second enter the loop
  {
   msTick = millis();
   GetTijd(false);                                                                            // Get the time for the seconds 
   Toggle = !Toggle;                                                                          // Used to turn On or Off Leds
   UpdateStatusLEDs(Toggle);
   SetSecondColour();                                                                         // Set the colour per second of 'IS' and 'WAS' 
   DimLeds(TestLDR);                                                                          // Every second an intensity check and update from LDR reading 
   if (shouldReboot) { delay(3000);   ESP.restart(); }                                        // After finish OTA update restarts after 3 seconds. 1 second is too fast
   if (timeinfo.tm_min != lastminute) EveryMinuteUpdate();                                    // Enter the every minute routine after one minute; 
   Loopcounter=0;
 }  
}
//--------------------------------------------                                                //
// COMMON Update routine 
  // Performs tasks every 0.1 second
//--------------------------------------------
void Every100mSecCheck(void)
{
 if (Mem.UseRotary==3 || Mem.UseRotary==4) IrReceiverDecode();
 if (ntpJustSynced) CheckandPrintNTPsynced();
}
//--------------------------------------------                                                //
// COMMON Update routine done every minute
//-------------------------------------------- 
void EveryMinuteUpdate(void)
{   
 lastminute = timeinfo.tm_min;  
 if (Mem.RandomDisplay == 1) { ChangeRandomDisplay(); SetSecondColour();} 
 if (IR_PowerOnstate && ((millis() - IR_StartTime) > 290000) ) ToggleIRpower();               // Turn off Power after 300 seconds 
 GetTijd(false);
 bool ff = NoTextInLeds; 
 if (Mem.TimeLogPrint == 0 || Mem.TimeLogPrint == 2)                                              // Do not print time but do update the display                                                              // do not Print the time string every minute
    { NoTextInLeds = true; DimLeds(false);  Displaytime();    }
 if (Mem.TimeLogPrint == 1)                                                                     // Print the time string every minute
    { NoTextInLeds = false; DimLeds(true);  Displaytime();    Tekstprintln(""); }

