ednieuw/Arduino-ESP32-Nano-Wordclock/ESP32_WordClockV195/ESP32_WordClockV195.ino
//--------------------------------------------                                                //
// COMMON Print Software naam without path
// for MacOS/Linux / and Windows \
//--------------------------------------------
const char* SoftwareName(void)
{
 const char* path = __FILE__;
 const char* end  = strstr(path, ".ino");
 if (!end) return path;
 const char* p = end;
 while (p > path && *(p - 1) != '/' && *(p - 1) != '\\')   p--;
 return p;
}
//--------------------------------------------                                                //
// COMMON Version info
//--------------------------------------------
void SWversion(void) {SWversion(LastMenuformat);}                                             // LastMenuformat is default after startup true (= small menu)   
void SWversion(bool Small) 
{ 
 html_info[0] = 0;                                                                            // Empty the info web page to be used in void WTekstprintln() 
 LastMenuformat = Small;
 PrintLine(35);
 if(Small) {for (uint8_t i = 0; i < sizeof(menusmall) / sizeof(menusmall[0]);                   WTekstprintln(menusmall[i++]) ); }
 else      {for (uint8_t i = 0; i < sizeof(menu) / sizeof(menu[0]);                             WTekstprintln(menu[i++]) ); }                                     
 PrintLine(35);
 snprintf(sptext, sizeof(sptext),"Display off between: %02dh - %02dh",Mem.TurnOffLEDsAtHH, Mem.TurnOnLEDsAtHH);  WTekstprintln(sptext);
 PrintDisplayChoice(false);                                                                     WTekstprintln(sptext);
  if(!Small) { snprintf(sptext, sizeof(sptext), "RandomDisplay:%s, Timestamp:%s", 
               Mem.RandomDisplay==1 ? "On/min" :  Mem.RandomDisplay==2 ? "On/hour" : "Off",
               Mem.TimeLogPrint==1 ? "/min" : Mem.TimeLogPrint==2 ? "/hour" : " Off" );         WTekstprintln(sptext); } 
 snprintf(sptext, sizeof(sptext),"Slope: %d     Min: %d     Max: %d ",
                 Mem.LightReducer, Mem.LowerBrightness,Mem.UpperBrightness);                    WTekstprintln(sptext);
 if(!Small) {snprintf(sptext, sizeof(sptext),"SSID: %s", Mem.SSID);                             WTekstprintln(sptext); }
// snprintf(sptext, sizeof(sptext),"Password: %s", Mem.Password);                               WTekstprintln(sptext);
 snprintf(sptext, sizeof(sptext),"BLE name: %s", Mem.BLEbroadcastName);                         WTekstprintln(sptext,"<span class=\"verdana-red\">","</span>");
 snprintf(sptext, sizeof(sptext),"IP-address: %d.%d.%d.%d", WiFi.localIP()[0], WiFi.localIP()[1], 
                                           WiFi.localIP()[2], WiFi.localIP()[3] );              WTekstprint(sptext);
 snprintf(sptext, sizeof(sptext),"/update");                                                    WTekstprintln(sptext," <a href=" , "> /update</a>");                                            
 if(!Small) {snprintf(sptext, sizeof(sptext),"Timezone:%s", Mem.Timezone);                      WTekstprintln(sptext); }
 snprintf(sptext, sizeof(sptext),"%s %s %s %s", Mem.WIFIOn?"WIFI=On":"WIFI=Off", 
                               Mem.NTPOn? "NTP=On":"NTP=Off",
                               Mem.BLEOn? "BLE=On":"BLE=Off",
                               Mem.UseBLELongString? "FastBLE=On":"FastBLE=Off" );              WTekstprintln(sptext);
 char fftext[20], ffftext[20];              
 if(!Small) {sprintf(fftext,"%s", Mem.UseDS3231?"DS3231=On":"DS3231=Off"); }
 if(!Small) {sprintf(ffftext,"%s", Mem.UseRotary==5?"TimeReceiver=On":"TimeReceiver=Off"); } 
 if(!Small) {snprintf(sptext, sizeof(sptext),"%s %s %s",Mem.UseRotary==0 ?"No Rotary, ":
                        Mem.UseRotary==1 ?"Rotary=On":
                        Mem.UseRotary==2 ?"Membrane=On":
                        Mem.UseRotary==3 ?"IR-remote=On":
                        Mem.UseRotary==4 ?"Ir-remote=On":"NOP",fftext,ffftext);                        WTekstprintln(sptext); }                           
 if(!Small) { snprintf(sptext, sizeof(sptext),"%s strip with %d LEDs (switch %%)", 
                 Mem.LEDstrip==0?"SK6812":Mem.LEDstrip==1?"WS2812":"NOP",(int) NUM_LEDS);       WTekstprintln(sptext); }
 // if(!Small) {sprintf(sptext,"Software: %s",FILENAAM);                                          WTekstprintln(sptext);}  // VERSION);
  if(!Small) { sprintf(sptext, "Software: %s", SoftwareName());                                 WTekstprintln(sptext);}
  if(!Small) {snprintf(sptext, sizeof(sptext),"ESP32 Arduino core version: %d.%d.%d", 
          ESP_ARDUINO_VERSION_MAJOR,ESP_ARDUINO_VERSION_MINOR,ESP_ARDUINO_VERSION_PATCH);       WTekstprintln(sptext); }
 GetTijd(false);                                                                              // Get the time and store it in the proper variables
 PrintLine(35);                                                                               //
}

//--------------------------------------------                                                //
// COMMON Print a _ line of n length
//--------------------------------------------
void PrintLine(byte Lengte)
{
 for(int n=0; n<Lengte; n++) sptext[n]='_';
 sptext[Lengte] = 0;
 WTekstprintln(sptext);
 sptext[0] = 0;                                                                               // Suppress a second print of sptext
}

//--------------------------------------------                                                //
// COMMON Input from Bluetooth, Serial or HTML page
//--------------------------------------------
void ReworkInputString(String InputString)
{
 if(InputString.length()> 40){Tekstprintln("Input string too long (max40)\n"); return;}       // If garbage return
 InputString.trim();                                                                          // Remove CR, LF etc.
 sptext[0] = 0;                                                                               // Suppress a second print of sptext 
 if(InputString[0] > 31 && InputString[0] < 127)                                              // Does the string start with a letter?
  {
  int len = InputString.length();
  switch(toupper(InputString[0])) 
   {
    case 'A':                                                                                 // SSID setting
      if(len > 4 && len < 30) 
        {
        InputString.substring(1).toCharArray(Mem.SSID, len);
        snprintf(sptext, sizeof(sptext), "SSID set: %s", Mem.SSID);
        Mem.WIFIcredentials = NOT_SET;    
        WIFIwasConnected = false;    
        } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Use between 4 and 30 characters ****");
      break;
      
    case 'B':                                                                                 // Password setting
      if(InputString.equals("BBBB")) 
      {
        snprintf(sptext, sizeof(sptext), "%s,**** Length fault. Use between 5 and 40 characters ****", Mem.Password);
        break;
      }
      if(len > 4 && len < 40) 
        {
        InputString.substring(1).toCharArray(Mem.Password, len);
        snprintf(sptext, sizeof(sptext), "Password set: %s\n Enter @ to reset ESP32 and connect to WIFI and NTP\n WIFI and NTP are turned ON", Mem.Password);
        Mem.NTPOn = Mem.WIFIOn = 1;                                                           // Turn both on
        Mem.WIFIcredentials = NOT_SET;
        WIFIwasConnected = false;
        } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Use between 5 and 40 characters ****");
      break;

    case 'C':                                                                                 // BLE settings
      if(InputString.equals("CCC")) 
       {
        Mem.BLEOn = 1 - Mem.BLEOn;
        snprintf(sptext, sizeof(sptext), "BLE is %s after restart", Mem.BLEOn ? "ON" : "OFF");
        break;
       }
      if(len > 4 && len < 30) 
       {
        InputString.substring(1).toCharArray(Mem.BLEbroadcastName, len);
        snprintf(sptext, sizeof(sptext), "BLE broadcast name set: %s", Mem.BLEbroadcastName);
        Mem.BLEOn = 1;
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Use between 4 and 30 characters ****");
      break;
      
    case 'D':                                                                                 // Date entry
      if(len == 9) 
       {
        timeinfo.tm_mday = (int)SConstrainInt(InputString, 1, 3, 0, 31);
        timeinfo.tm_mon  = (int)SConstrainInt(InputString, 3, 5, 0, 12) - 1;
        timeinfo.tm_year = (int)SConstrainInt(InputString, 5, 9, 2000, 9999) - 1900;
        if(DS3231Installed)   SetDS3231Time();
        else snprintf(sptext, sizeof(sptext), "No external RTC module detected");
       } 
      else snprintf(sptext, sizeof(sptext), "****\nLength fault. Enter Dddmmyyyy\n****");
      break;
      
    case 'E':                                                                                 // Time zone setting
      if(len > 2) 
       {
        InputString.substring(1).toCharArray(Mem.Timezone, len);
        snprintf(sptext, sizeof(sptext), "Timezone set: %s", Mem.Timezone);
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Use more than 2 characters ****");
      break;
      
    case 'F': 
      snprintf(sptext, sizeof(sptext),"Stored colour: 0X%08" PRIX32, Mem.OwnColour);      
      if (len==5)                                                                             // Decimal number input (0–9 per digit) 
         {
          String Input = InputString.substring(1, 5);                                         // and map each digit to a corresponding byte intensity from 0x00 to 0xFF
          uint32_t Color = 0;                                                                 // 
          for (int i = 0; i < Input.length(); i++) 
             {
              int Digit = Input[i] - '0';                                                     // convert char to int 0–9
              uint8_t level = map(Digit, 0, 9, 0, 255);                                       // scale 0–9 → 0–255
              Color = (Color << 8) | level;                                                   // pack into 32-bit value
             }   
          LetterColor = Mem.OwnColour = Color;
         }
      else if (len == 9) 
         {                                                                                    // Hexadecimal number input (00 - FF per colour) 
          String HexPart = InputString.substring(1, 9);
          LetterColor = Mem.OwnColour = strtoul(HexPart.c_str(), nullptr, 16);
         }
       else 
         {
          snprintf(sptext, sizeof(sptext),"Enter Fwwrrggbb hexadecimal (0 - F)\nOr Fwrgb decimal 0 - 9\nStored: 0X%08" PRIX32, Mem.OwnColour);
          break;
         }
      snprintf(sptext, sizeof(sptext), "**** Own colour changed ****\nFont colour now: 0X%08" PRIX32, Mem.OwnColour);
      Tekstprintln(sptext);
      LedsOff();                                                                              // Clear the display
      SetSecondColour();                                                                      // Set the colour per second of 'IS' and 'WAS' 
      Displaytime();Tekstprintln("");
      sptext[0]=0;                                                                            // Suppress a second print of sptext
      break;

    case 'G':                                                                                 // Scan WIFI stations
      if(len == 1) 
       {
        CheckforWIFINetwork(true);
        if(WIFIwasConnected) WiFi.reconnect();
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Enter G ****");
      break;

    case 'H':                                                                                 // Use rotary encoder
      if(len == 3) 
       {
        byte Choice = (byte)SConstrainInt(InputString, 2, 0, 5);                                 // keep the range between 0 and 5; H00 - H05
        if (Choice <5) Mem.UseRotary = Choice;
        else
            {
            if (Choice ==5) Mem.TimeReceiver = 1 - Mem.TimeReceiver;
            }
        if(Mem.UseRotary > 4) Mem.UseRotary = 0;
        Tekstprintln("*** Restart with @ to activate Rotary, key pad, Time sender app or IR remote ***");    // 
        if(Mem.UseRotary > 0)  {Mem.NTPOn = 0;              Mem.UseDS3231 = 1;}              // Configure related settings based on rotary use 
        else                   {Mem.WIFIOn = Mem.NTPOn = 1; Mem.UseDS3231 = 0;}
        } 
      else Tekstprintln("Error **** Enter H00 (none), H01=Rotary, H02=Membrane, H03 large IR-remote, H04 tiny IR-remote, H05 Time sender app ****");
      sprintf(sptext, "\n Use of rotary encoder is %s\n"
                        "         Use of keypad is %s\n"
                        "Use of large IR-remote is %s\n"
                        " Use of tiny IR-remote is %s\n"
                        "Use of Time sender app is %s",                        
                        Mem.UseRotary == 1 ? "ON" : "OFF", Mem.UseRotary == 2 ? "ON" : "OFF",
                        Mem.UseRotary == 3 ? "ON" : "OFF", Mem.UseRotary == 4 ? "ON" : "OFF",
                        Mem.TimeReceiver   ? "ON" : "OFF");
      Tekstprintln(sptext);      
      sprintf(sptext, "Use DS3231 is %s, WIFI is %s, NTP is %s\n *** Restart clock with @ ***", 
                       Mem.UseDS3231 ? "ON" : "OFF", Mem.WIFIOn ? "ON" : "OFF", Mem.NTPOn ? "ON" : "OFF");     
      if(Mem.UseRotary >2) { while(IrReceiver.decode())  IrReceiver.resume();  }              // Clear all pending commands    
      break;

    case 'I':                                                                                 // Menu
      SWversion(len == 1);                                                                    // true for small menu, false for full menu
      break;
      
    case 'J':                                                                                 // Use DS3231 RTC module
      if(len == 1) 
      {
        Mem.UseDS3231 =  1 - Mem.UseDS3231;
        Mem.NTPOn     = (1 - Mem.UseDS3231);
        if(Mem.WIFIOn == 0) Mem.NTPOn = 0;                                                    // If WIFI is Off then No NTP
        snprintf(sptext, sizeof(sptext), "Use DS3231 is %s, WIFI is %s, NTP is %s", 
                Mem.UseDS3231 ? "ON" : "OFF", Mem.WIFIOn ? "ON" : "OFF", Mem.NTPOn ? "ON" : "OFF");
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Enter J ****");
      break;
      
