ednieuw/Arduino-ESP32-Nano-Wordclock/ESP32_WordClockV195/ESP32_WordClockV195.ino
void DitLeHeure(void)
{
 byte sayhour = timeinfo.tm_hour;
 if (timeinfo.tm_min > 33 ) sayhour = timeinfo.tm_hour+1;
 if (sayhour == 24) sayhour = 0;

switch (sayhour)
 {
  case 13:  
  case 1:  UNE;    HEURE;  break;
  case 14:
  case 2:  DEUX;   HEURES;  break;
  case 15:
  case 3:  TROIS;  HEURES;  break;
  case 16:
  case 4:  QUATRE; HEURES; break;
  case 17:
  case 5:  CINQ;   HEURES;   break;
  case 18:
  case 6:  SIX;    HEURES;   break;
  case 19:
  case 7:  SEPT;   HEURES;  break;
  case 20:
  case 8:  HUIT;   HEURES; break;
  case 21:
  case 9:  NEUF;   HEURES; break;
  case 22:
  case 10: DIX;    HEURES; break;
  case 23:
  case 11: ONZE;   HEURES; break;
  case 0:  MINUIT; break;
  case 12: MIDI;   break;
 } 
}
                     #endif //FR

//------------------ BLE

//--------------------------------------------                                                //
// BLE SendMessage by BLE Slow in packets of 20 chars
// or fast in one long string.
// Fast can be used in IOS app BLESerial Pro
//--------------------------------------------
void SendMessageBLE(std::string Message)
{
 if(BLEConnected) 
   {
    if (Mem.UseBLELongString)                                                                 // If Fast transmission is possible
     {
      pTxCharacteristic->setValue(Message); 
      pTxCharacteristic->notify();
      delay(10);                                                                              // Bluetooth stack will go into congestion, if too many packets are sent
     } 
   else                                                                                       // Packets of max 20 bytes
     {   
      int parts = (Message.length()/20) + 1;
      for(int n=0;n<parts;n++)
        {   
         pTxCharacteristic->setValue(Message.substr(n*20, 20)); 
         pTxCharacteristic->notify();
         delay(10);                                                                           // Bluetooth stack will go into congestion, if too many packets are sent
        }
     }
   } 
}

//--------------------------------------------                                                //
// BLE Start BLE Classes NimBLE Version 2.x.x
//--------------------------------------------
class MyServerCallbacks: public NimBLEServerCallbacks 
{
 void onConnect(NimBLEServer* pServer, NimBLEConnInfo& connInfo) override 
    {BLEConnected = true; Tekstprintln("BLE Connected"   );}
 void onDisconnect(NimBLEServer* pServer, NimBLEConnInfo& connInfo, int reason) override 
    {BLEConnected = false; Tekstprintln("BLE Disconnected" );}
};
  
class MyCallbacks: public NimBLECharacteristicCallbacks 
{
 void onWrite(NimBLECharacteristic *pCharacteristic, NimBLEConnInfo& connInfo) override  
  {
   std::string rxValue = pCharacteristic->getValue();
   ReceivedMessageBLE = rxValue + "\n";
  //  if (rxValue.length() > 0) {for (int i = 0; i < rxValue.length(); i++) printf("%c",rxValue[i]); }  printf("\n");
  }  
};

//--------------------------------------------                                                //
// BLE Start BLE Service
//--------------------------------------------
void StartBLEService(void)
{
 NimBLEDevice::init(Mem.BLEbroadcastName);                                                    // Create the BLE Device
 pServer = NimBLEDevice::createServer();                                                      // Create the BLE Server
 pServer->setCallbacks(new MyServerCallbacks());
 BLEService *pService = pServer->createService(SERVICE_UUID);                                 // Create the BLE Service
 pTxCharacteristic                     =                                                      // Create a BLE Characteristic 
     pService->createCharacteristic(CHARACTERISTIC_UUID_TX, NIMBLE_PROPERTY::NOTIFY);                 
 BLECharacteristic * pRxCharacteristic = 
     pService->createCharacteristic(CHARACTERISTIC_UUID_RX, NIMBLE_PROPERTY::WRITE);
 pRxCharacteristic->setCallbacks(new MyCallbacks());
 pService->start(); 
 BLEAdvertising *pAdvertising = NimBLEDevice::getAdvertising();
 pAdvertising->addServiceUUID(SERVICE_UUID); 
 pAdvertising->setName(Mem.BLEbroadcastName);
 pServer->start();                                                                            // Start the server  Nodig??
 pServer->getAdvertising()->start();    
    // Add this to keep advertising running
 //   pAdvertising->setConnectable(true);                                                     // Start advertising
 TekstSprint("BLE Waiting a client connection to notify ...\n"); 
}

//--------------------------------------------                                                //
// BLE Disconnect BLE Service
// NimBLE's built-in disconnect (higher level)
//--------------------------------------------
void DisconnectBLE(void) 
{
 auto* server = NimBLEDevice::getServer();
 if (server) 
   {
    server->disconnect(0);                                                                    // 0 = first connected client
    BLEConnectedSince = 0;
   }
}
//--------------------------------------------                                                //
// BLE CheckBLE input and rework string
// After 1/4 hour the BLE connection is disconnected
//--------------------------------------------
void CheckBLE(void)
{
if (BLEConnected && !oldBLEConnected) 
  {
   oldBLEConnected = BLEConnected;
   BLEConnectedSince = millis();                                                              // Mark time of last connection 1/4 hour after this time the BLE connection will disconnect
  }
if (!BLEConnected && oldBLEConnected)                                                        // If device is disconnected start advertising
  {
   delay(300);
   pServer->startAdvertising();
   TekstSprint("Start advertising\n");
   oldBLEConnected = BLEConnected;
   BLEConnectedSince = 0;                                                                     // Reset BLE connection timer
  }
if ((BLEConnected && BLEConnectedSince > 0) && (millis() - BLEConnectedSince > 900000))       // Disconnect if connected longer than 15 minutes inactivity 
  {
   auto connHandles = NimBLEDevice::getServer()->getPeerDevices();                            // Vector of uint16_t handles
   if (!connHandles.empty()) 
     {
      uint16_t conn_handle = connHandles[0];
      int rc = ble_gap_terminate(conn_handle, BLE_ERR_REM_USER_CONN_TERM);                    // Reason = 0x13 = user terminated
      if (rc == 0) { TekstSprint("Disconnected BLE client after 1/4 hour\n"); } 
      else {snprintf(sptext, sizeof(sptext),"BLE disconnect failed, error: %d\n", rc); TekstSprint(sptext);}
       BLEConnectedSince = 0;
      }
  }
 if(ReceivedMessageBLE.length()>0)
   {
    SendMessageBLE(ReceivedMessageBLE);
    String BLEtext = ReceivedMessageBLE.c_str();
    ReceivedMessageBLE = "";
    ReworkInputString(BLEtext); 
    BLEConnectedSince = millis();                                                             // Mark time of last connection 1/4 hour after this time the BLE connection will disconnect
   }
}

// --------- Time Receiver. Connect to TimeSender TIMESENDER_DEVICE_NAME "BLE-UARTtime"
//--------------------------------------------                                                //
// BLE TimeReceiver client
//--------------------------------------------
void SendMessageTimeReceiver(const char* msg)
{
 if (!TRConnected || !msg || !pRemoteRX || !pClient) return;
 if (!pClient->isConnected()) { TRConnected = false; return; }
 size_t len = strlen(msg);
 pRemoteRX->writeValue((uint8_t*)msg, len, false);
}



//--------------------------------------------                                                //
// BLE TimeReceiver Reconnect time receiver
//--------------------------------------------
void ReconnectTimeReceiver() 
{
 if (pClient && pClient->isConnected()) { pClient->disconnect();  }
 vTaskDelay(200 / portTICK_PERIOD_MS);
 TRConnected        = false;                                                                  // Trigger reconnection
 TRConnecting       = false;
 TRhaveFoundAddr    = true;                                                                   // Keep the address
 TRconnectRequested = true;
 Connect_TimeReceiver();                                                                      // The main loop should call Connect_TimeReceiver() Or call it directly here:
}
//--------------------------------------------                                                //
// BLE TimeReceiver RX notify callback
// -------------------------------------------
static void TimeReceiverNotifyCB( NimBLERemoteCharacteristic*,  uint8_t* data, size_t len, bool notify)
{
 static char buf[128];
 size_t n = (len < sizeof(buf) - 1) ? len : sizeof(buf) - 1;
 memcpy(buf, data, n);
 buf[n] = 0;
 ReworkInputString(String(buf));
 BLEConnectedSince = millis();
}

//--------------------------------------------                                                //
// BLE TimeReceiver Scan callbacks
// Client callbacks
// -------------------------------------------
class TimeReceiverClientCB : public NimBLEClientCallbacks
{
 void onConnect(NimBLEClient* client) override
   {
    TRConnected = true;
    TRConnecting = false;
    BLEConnectedSince = millis();
       Tekstprintlnf("TimeReceiver connected to: %s", Mem.BLEbroadcastName);
   }

 void onDisconnect(NimBLEClient* client, int reason) override
   {
    Tekstprintlnf("TimeReceiver disconnected (reason: %d)", reason); 
    TRConnected        = false;
    TRConnecting       = false;
    TRhaveFoundAddr    = false;
    TRconnectRequested = false;
    TimeReceiverRunning  = false;                                                            // Reset flag
    if (pClient)                                                                             // Clean up client
    {
      NimBLEDevice::deleteClient(pClient);
      pClient = nullptr;
    }
    pRemoteTX = nullptr;
    pRemoteRX = nullptr;
    NimBLEScan* scan = NimBLEDevice::getScan();                                               // Stop any existing scan first
    if (scan->isScanning())  {  scan->stop();   delay(100);  }
    delay(200);
    StartTimeReceiverScan();                                                                  // Start new scan
   }
};

//--------------------------------------------                                                //
// Scan callbacks
//--------------------------------------------
class TimeReceiverScanCB : public NimBLEScanCallbacks
{
 void onResult(const NimBLEAdvertisedDevice* dev) override
   {
    if (TRConnecting) return;
    if (!dev->haveName()) return;
    std::string rawName = dev->getName();
    if (rawName.find(TIMESENDER_DEVICE_NAME) == std::string::npos) return;
    if (dev->getRSSI() <= TIMERECEIVER_MIN_RSSI) return;
    if (!dev->isConnectable()) return;
    if (!dev->isAdvertisingService(NimBLEUUID(SERVICE_UUID))) return;
    TRfoundAddr        = dev->getAddress();
    TRhaveFoundAddr    = true;
    TRconnectRequested = true;
    NimBLEDevice::getScan()->stop();
   }
};

//--------------------------------------------                                                //
// BLE TimeReceiver Start Time Receiver scan
//--------------------------------------------
void StartTimeReceiverScan(void)
{
 NimBLEScan* scan = NimBLEDevice::getScan();
 if (TimeReceiverRunning && !scan->isScanning())                                              // Reset flag if scan isn't actually running
   {
    TimeReceiverRunning = false;
    Tekstprintln("Flag reset - scan not running");
   }
 if (TimeReceiverRunning)  { Tekstprintln("Scan already running - skipping");   return;}     // Only start if not already running
 if (scan->isScanning()) { scan->stop();  delay(100);}                                        // Stop any existing scan 
 TimeReceiverRunning = true; 
 scan->setActiveScan(true);
 scan->setInterval(160);
 scan->setWindow(30);
 scan->setScanCallbacks(new TimeReceiverScanCB(), true);  // true = delete old callback 
 if (!scan->start(0, false, false))
   {
    Tekstprintln("ERROR: Failed to start TimeReceiver scan");
    TimeReceiverRunning = false;
   }
 else
   {
    LastTimeReceiverScan = millis();
    Tekstprintln("TimeReceiver scan started");
   }
}
//--------------------------------------------                                                //
// BLE TimeReceiver Stop Time Receiver
//--------------------------------------------
void StopTimeReceiver()
{
 NimBLEDevice::getScan()->stop();
 if (TRConnected) pClient->disconnect();
 TRConnected = false;
 TRConnecting          = false;
 pRemoteTX             = nullptr;
 pRemoteRX             = nullptr;
 pClient               = nullptr;
 TRhaveFoundAddr       = false;
 TRconnectRequested    = false;
}

//--------------------------------------------                                                //
// BLE TimeReceiver Connect TimeReceiver
// -------------------------------------------
static void Connect_TimeReceiver(void)
{
 if (!TRhaveFoundAddr || TRConnected || TRConnecting) return;
 const int MAX_CONNECT_ATTEMPTS = 3;
 const unsigned long POST_DISCONNECT_DELAY_MS = 150;
 
 for (int attempt = 1; attempt <= MAX_CONNECT_ATTEMPTS; ++attempt)
    {
     NimBLEDevice::getScan()->stop();
     delay(100);
     pClient = NimBLEDevice::createClient();
     pClient->setClientCallbacks(new TimeReceiverClientCB(), false);
     TRConnecting      = true;
     TRconnectStartms  = millis();
     
